{
  "eixos": [
    {
      "nome": "Eixo 1 — Comportamento Alimentar",
      "perguntas": [
        {
          "id": 1,
          "texto": "Você evita comer em público por vergonha do que as pessoas podem pensar?",
          "peso_sim": 2,
          "peso_nao": 1,
          "justificativa": "Vergonha social e medo de julgamento. Indica evitação social relacionada à alimentação."
        },
        {
          "id": 2,
          "texto": "Você costuma pular refeições para compensar o que comeu antes?",
          "peso_sim": 3,
          "peso_nao": 1,
          "justificativa": "Restrição e compensação. Mostra comportamento compensatório, associado a anorexia e bulimia."
        },
        {
          "id": 3,
          "texto": "Você sente que perdeu o controle ao comer, mesmo quando não está com fome?",
          "peso_sim": 3,
          "peso_nao": 1,
          "justificativa": "Impulsividade e perda de controle. Indica compulsão alimentar."
        },
        {
          "id": 4,
          "texto": "Você já se sentiu compelido(a) a se exercitar logo depois de comer?",
          "peso_sim": 3,
          "peso_nao": 1,
          "justificativa": "Culpa e comportamento compensatório. Indício de ciclo compensatório."
        }
      ]
    },
    {
      "nome": "Eixo 2 — Imagem Corporal",
      "perguntas": [
        {
          "id": 5,
          "texto": "Você acredita que seu valor como pessoa depende de seu peso ou aparência?",
          "peso_sim": 3,
          "peso_nao": 1,
          "justificativa": "Autoestima e valor pessoal. Núcleo identitário do transtorno."
        },
        {
          "id": 6,
          "texto": "Você sente que ser magro(a) ou ter certo corpo faria você ser mais aceito(a) ou respeitado(a)?",
          "peso_sim": 3,
          "peso_nao": 1,
          "justificativa": "Validação social e ideal corporal. Demonstra internalização de padrões de beleza."
        },
        {
          "id": 7,
          "texto": "Você já deixou de participar de algo (fotos, encontros, festas) por vergonha do seu corpo?",
          "peso_sim": 2,
          "peso_nao": 1,
          "justificativa": "Isolamento e vergonha corporal. Indica prejuízo funcional e sofrimento social."
        },
        {
          "id": 8,
          "texto": "Você sente que precisa merecer comer ou descansar?",
          "peso_sim": 3,
          "peso_nao": 1,
          "justificativa": "Culpa moral e auto-punição. Relação moralizada com o corpo e a comida."
        }
      ]
    },
    {
      "nome": "Eixo 3 — Emoção e Autoconceito",
      "perguntas": [
        {
          "id": 9,
          "texto": "Você sente culpa ou vergonha depois de comer?",
          "peso_sim": 3,
          "peso_nao": 1,
          "justificativa": "Culpa e vergonha alimentar. Indicam internalização de regras rígidas."
        },
        {
          "id": 10,
          "texto": "Você come (ou deixa de comer) quando está ansioso(a), triste ou irritado(a)?",
          "peso_sim": 2,
          "peso_nao": 1,
          "justificativa": "Regulação emocional pela comida. Uso emocional da alimentação."
        },
        {
          "id": 11,
          "texto": "A comida às vezes te traz alívio ou sensação de segurança?",
          "peso_sim": 2,
          "peso_nao": 1,
          "justificativa": "Associação comida-conforto. Indica função emocional compensatória."
        },
        {
          "id": 12,
          "texto": "Você sente que comer é uma forma de se acalmar?",
          "peso_sim": 3,
          "peso_nao": 1,
          "justificativa": "Autocontrole e regulação emocional. Dependência emocional da alimentação."
        }
      ]
    },
    {
      "nome": "Eixo 4 — Controle e Rotina",
      "perguntas": [
        {
          "id": 13,
          "texto": "Você sente ansiedade se sua rotina alimentar muda?",
          "peso_sim": 2,
          "peso_nao": 1,
          "justificativa": "Ansiedade e rigidez cognitiva. Rigidez comportamental e dificuldade de adaptação."
        },
        {
          "id": 14,
          "texto": "Você já evitou sair ou participar de eventos por medo de perder o controle sobre o que vai comer?",
          "peso_sim": 3,
          "peso_nao": 1,
          "justificativa": "Medo de descontrole e isolamento. Restrição por medo e prejuízo social."
        },
        {
          "id": 15,
          "texto": "Você sente que precisa seguir regras rígidas sobre o que pode ou não comer?",
          "peso_sim": 3,
          "peso_nao": 1,
          "justificativa": "Controle e perfeccionismo. Pensamento dicotômico."
        },
        {
          "id": 16,
          "texto": "Você sente culpa quando sai da dieta, mesmo que seja algo pequeno?",
          "peso_sim": 3,
          "peso_nao": 1,
          "justificativa": "Culpa e autoavaliação rígida. Moralização e autocondenação."
        },
        {
          "id": 17,
          "texto": "Você se sente ansioso(a) se não consegue controlar a própria alimentação?",
          "peso_sim": 3,
          "peso_nao": 1,
          "justificativa": "Ansiedade de controle. Dependência de controle alimentar."
        }
      ]
    },
    {
      "nome": "Eixo 5 — Percepção do Problema",
      "perguntas": [
        {
          "id": 18,
          "texto": "O paciente está ciente de que seu modo de se alimentar pode prejudicar sua saúde? (Caso não prejudique, apertar sim também)",
          "peso_sim": 1,
          "peso_nao": 3,
          "justificativa": "Insight e consciência do risco. Negação é fator mantedor."
        },
        {
          "id": 19,
          "texto": "Pessoas próximas já demonstraram preocupação com a forma do paciente se alimentar?",
          "peso_sim": 3,
          "peso_nao": 1,
          "justificativa": "Impacto social e relacional. Comportamento perceptível para outros."
        },
        {
          "id": 20,
          "texto": "O paciente sente medo de ganhar peso, mesmo sabendo que isso possa ser necessário?",
          "peso_sim": 3,
          "peso_nao": 1,
          "justificativa": "Fobia de ganho de peso. Sintoma cardinal de anorexia."
        },
        {
          "id": 21,
          "texto": "O paciente sente que os outros exagerem quando se preocupam com sua alimentação ou corpo apesar de apresentar sinais preocupantes? (Caso não tenha apresentado sinais, apertar não)",
          "peso_sim": 3,
          "peso_nao": 1,
          "justificativa": "Minimização e distorção cognitiva. Fator de risco para não adesão."
        },
        {
          "id": 22,
          "texto": "Alguém já sugeriu para o paciente que talvez sua relação com comida esteja causando sofrimento, e ele preferiu não pensar sobre isso? (Aperte não caso não apresente sofrimento)",
          "peso_sim": 3,
          "peso_nao": 1,
          "justificativa": "Evitação e resistência ao reconhecimento. Falta de prontidão para mudança."
        }
      ]
    }
  ]
}
